// data.js
const bosses = [
    "鉄甲熔炎帝王", "アンドリアス", "ニニアン", "禍津御建鳴神命", "ディアンナラ",
    "恒常からくり陣形", "無相の炎", "正機の神", "無相の雷", "アペプ",
    "黄金王獣", "氷風組曲コッペリア", "リアム", "急凍樹", "戦羊・鉄爪",
    "赤璋巡岳府君", "銅の掟", "暴君・金焔のクク竜", "アビサルヴィシャップ", "実験用フィールド生成装置",
    "魔偶剣鬼", "迅電樹", "エンシェントヴィシャップ・岩", "氷風組曲コペリウス", "ジャプー",
    "召使", "微末", "輝ける溶岩の龍像", "千年真珠の海駿", "深罪の浸礼者",
    "グーシートース", "シネアス", "無相の草", "吞星の鯨", "異色三連星",
    "公子", "バラチコ", "半永久統制マトリックス", "純水精霊", "無相の風",
    "ヴィヴィアン", "山の王・貪食のユムカ竜", "深淵なるミミック・パピラ", "秘源機兵・機構デバイス", "山隠れの猊獣",
    "魔像レガトゥス", "キング＆クイーン", "無相の氷", "淑女", "兆載永劫ドレイク",
    "コシーホ", "秘源機兵・統御デバイス", "爆炎樹", "リライ", "迷える霊覚の修権者",
    "イゾルト", "若陀龍王", "遺跡サーペント", "無相の水", "雷音権現",
    "無相の岩", "水形タルパ", "風食ウェネト", "ロッキー", "マッシュラプトル", "ピーク"
];

const constraints = [
    "☆４キャラ武器", "回復禁止", "恒常☆５縛り", "所持率100％縛り", "国縛り",
    "初期キャラのみ", "UI非表示＋リロール", "誰か一人が倒れたら負け縛り", "無凸縛り", "キャラルーレット",
    "武器種縛り", "キャラ武器ルーレット", "聖遺物禁止", "爆発禁止＋リロール", "旅人縛り",
    "モノ元素縛り", "各1.1縛り", "誕生月", "アルファベット縛り", "☆１、聖遺物なし"
];

const selectableConstraints = [
    "国縛り", "キャラルーレット", "武器種縛り", "キャラ武器ルーレット", "モノ元素縛り",
    "各1.1縛り", "誕生月", "アルファベット縛り", "武器ルーレット"
];

const fullyOwned = [
    "旅人", "香菱", "ガイア", "コレイ", "ノエル", "リサ", "バーバラ", "アンバー"
];

const permanent5Stars = [
    "ジン", "ディルック", "ディシア", "夢見月瑞希", "七七", "モナ", "ティナリ"
];

const countries = [
    "モンド", "璃月", "稲妻", "スメール", "フォンテーヌ", "ナタ", "スネージナヤ", "例外"
];

const weaponTypes = [
    "片手剣", "両手剣", "長柄武器", "法器", "弓"
];

const elements = [
    "炎", "水", "氷", "岩", "草", "風", "雷"
];

const versions = [
    "n.0", "n.1", "n.2", "n.3", "n.4", "n.5", "n.6", "n.7", "n.8"
];

const months = [
    "1月", "2月", "3月", "4月", "5月", "6月", "7月", "8月", "9月", "10月", "11月", "12月"
];

const alphabets = [
    "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "Q", "R", "S", "T", "V", "W", "X", "Y", "Z"
];

const weapons = {
    "片手剣": [
        "厄水の災い", "岩峰を巡る歌", "ストロングボーン", "エズピツァルの笛", "赦罪", "有楽御簾切", "水仙十字の剣",
        "静水流転の輝き", "船渠剣", "狼牙", "サーンドルの渡し守", "海淵のフィナーレ", "翠光の裁葉", "東花坊時雨",
        "サイフォスの月明かり", "聖顕の鍵", "原木刀", "籠鶴瓶一心", "黒岩の長剣", "黒剣", "黎明の神剣", "飛天御剣",
        "風鷹剣", "霧切の廻光", "降臨の剣", "銀の剣", "鉄蜂の刺し", "シナバースピンドル", "斬岩・試作", "西風剣",
        "蒼古なる自由への誓い", "腐食の剣", "笛の剣", "祭礼の剣", "盤岩結緑", "波乱月白経津", "暗鉄剣",
        "ダークアレイの閃光", "無鋒の剣", "旅道の剣", "斬山の刃", "旧貴族長剣", "天空の刃", "天目影打", "チ虎魚の刀",
        "匣中龍吟", "冷刃", "蒼耀"
    ],
    "両手剣": [
        "千烈の日輪", "実りの鉤鉈", "アースシェイカー", "山の王の長牙", "「スーパーアルティメット覇王魔剣」", "裁断",
        "携帯型チェンソー", "話死合い棒", "タイダル・シャドー", "葦海の標", "鉄彩の花", "マカイラの水色",
        "森林のレガリア", "黒岩の斬刀", "飛天大御剣", "雪葬の星銀", "雨裁", "鉄影段平", "鐘の剣", "赤角石塵滅砕",
        "古華・試作", "訓練用大剣", "西風大剣", "銜玉の海皇", "螭龍の剣", "祭礼の大剣", "白鉄の大剣", "白影の剣",
        "狼の末路", "龍血を浴びた剣", "桂木斬長正", "松韻の響く頃", "無工の剣", "惡王丸", "旧貴族大剣", "天空の傲",
        "千岩古剣", "傭兵の重剣", "理屈責め"
    ],
    "弓": [
        "冷寂の音", "星鷲の紅き羽", "花飾りの羽", "チェーンブレイカー", "築雲", "白雨心弦", "レンジゲージ",
        "烈日の後嗣", "静寂の唄", "始まりの大魔術", "トキの嘴", "王の近侍", "竭沢", "狩人の道", "落霞", "若水",
        "黒岩の戦弓", "鴉羽の弓", "飛来の鳴弦", "風花の頌歌", "アモスの弓", "リングボウ", "澹月・試作", "西風猟弓",
        "青翠の狩猟弓", "絶弦", "終焉を嘆く詩", "祭礼の弓", "シャープシューターの誓い", "破魔の弓", "狩猟弓",
        "曚雲の月", "ダークアレイの狩人", "プレデター", "弾弓", "弓蔵", "幽夜のワルツ", "旧貴族長弓", "天空の翼",
        "リカーブボウ", "歴戦の狩猟弓", "冬極の白星", "文使い"
    ],
    "法器": [
        "ヴィヴィッド・ハート", "寝正月の初晴", "祭星者の眺め", "波乗りの旋回", "ヤシュチェの環", "蒼紋の角杯",
        "サーフィンタイム", "鶴鳴の余韻", "凛流の監視者", "久遠流転の大典", "果てなき紺碧の唄", "古祠の瓏",
        "純水流華", "碧落の瓏", "トゥライトゥーラの記憶", "千夜に浮かぶ夢", "彷徨える星", "満悦の実", "黒岩の緋玉",
        "魔導緒論", "金珀・試作", "誓いの明瞳", "龍殺しの英傑譚", "西風秘典", "翡玉法珠", "祭礼の断片", "神楽の真意",
        "白辰の輪", "特級の宝玉", "流浪楽章", "ダークアレイの酒と詩", "昭心", "冬忍びの実", "異世界旅行記",
        "浮世の錠", "旧貴族秘法録", "生徒ノート", "天空の巻", "四風原典", "ドドコの物語", "ポケット魔導書",
        "匣中日月", "不滅の月華", "万国諸海の図譜"
    ],
    "長柄武器": [
        "香りのシンフォニスト", "玉響停の御噺", "鎮山の釘", "虹の行方", "ルミドゥースの挽歌", "赤月のシルエット",
        "砂中の賢者達の問答", "プロスペクタードリル", "フィヨルドの歌", "正義の報酬", "赤砂の杖", "風信の矛",
        "ムーンピアサー", "ドラゴンスピア", "黒纓槍", "黒岩の突槍", "鉄尖槍", "鉾槍", "破天の槍", "星鎌・試作",
        "西風長槍", "草薙の稲光", "白纓槍", "流月の針", "新米の長槍", "斬波のひれ長", "護摩の杖", "息災",
        "旧貴族猟槍", "天空の脊", "「漁獲」", "喜多院十文字槍", "和璞鳶", "千岩長槍", "匣中滅龍", "死闘の槍"
    ]
};

const characterWeaponMap = {
    "旅人": "片手剣", "シロネン": "片手剣", "クロリンデ": "片手剣", "千織": "片手剣", "フリーナ": "片手剣",
    "リネット": "片手剣", "綺良々": "片手剣", "アルハイゼン": "片手剣", "レイラ": "片手剣", "ニィロウ": "片手剣",
    "久岐忍": "片手剣", "アルベド": "片手剣", "行秋": "片手剣", "神里綾華": "片手剣", "神里綾人": "片手剣",
    "ジン": "片手剣", "ベネット": "片手剣", "楓原万葉": "片手剣", "刻晴": "片手剣", "ガイア": "片手剣",
    "七七": "片手剣", "スカーク": "片手剣", "ダリア": "片手剣",
    "マーヴィカ": "両手剣", "キィニチ": "両手剣", "嘉明": "両手剣", "ナヴィア": "両手剣", "フレミネ": "両手剣",
    "カーヴェ": "両手剣", "ディシア": "両手剣", "ドリー": "両手剣", "レザー": "両手剣", "重雲": "両手剣",
    "ディルック": "両手剣", "辛炎": "両手剣", "ノエル": "両手剣", "荒瀧一斗": "両手剣", "早柚": "両手剣",
    "北斗": "両手剣", "エウルア": "両手剣",
    "チャスカ": "弓", "オロルン": "弓", "セトス": "弓", "シグウィン": "弓", "リネ": "弓",
    "ファルザン": "弓", "コレイ": "弓", "ティナリ": "弓", "夜蘭": "弓", "ディオナ": "弓",
    "タルタリヤ": "弓", "フィッシュル": "弓", "甘雨": "弓", "ウェンティ": "弓", "宵宮": "弓",
    "アンバー": "弓", "ゴロー": "弓", "九条裟羅": "弓",
    "イファ": "法器", "ヴァレサ": "法器", "夢見月瑞希": "法器", "藍硯": "法器", "シトラリ": "法器",
    "ムアラニ": "法器", "閑雲": "法器", "シャルロット": "法器", "ヌヴィレット": "法器", "リオセスリ": "法器",
    "白朮": "法器", "放浪者": "法器", "ナヒーダ": "法器", "鹿野院平蔵": "法器", "モナ": "法器",
    "バーバラ": "法器", "スクロース": "法器", "珊瑚宮心海": "法器", "煙緋": "法器", "クレー": "法器",
    "凝光": "法器", "八重神子": "法器", "リサ": "法器",
    "エスコフィエ": "長柄武器", "イアンサ": "長柄武器", "カチーナ": "長柄武器", "エミリエ": "長柄武器", "アルレッキーノ": "長柄武器",
    "シュヴルーズ": "長柄武器", "ミカ": "長柄武器", "ヨォーヨ": "長柄武器", "キャンディス": "長柄武器", "セノ": "長柄武器",
    "魈": "長柄武器", "香菱": "長柄武器", "雷電将軍": "長柄武器", "鍾離": "長柄武器", "胡桃": "長柄武器",
    "ロサリア": "長柄武器", "申鶴": "長柄武器", "トーマ": "長柄武器", "雲菫": "長柄武器"
};

const characters = [
    "旅人", "シロネン", "クロリンデ", "千織", "フリーナ", "リネット", "綺良々", "アルハイゼン", "レイラ", "ニィロウ",
    "久岐忍", "アルベド", "行秋", "神里綾華", "神里綾人", "ジン", "ベネット", "楓原万葉", "刻晴", "ガイア",
    "七七", "スカーク", "ダリア", "マーヴィカ", "キィニチ", "嘉明", "ナヴィア", "フレミネ", "カーヴェ", "ディシア",
    "ドリー", "レザー", "重雲", "ディルック", "辛炎", "ノエル", "荒瀧一斗", "早柚", "北斗", "エウルア",
    "チャスカ", "オロルン", "セトス", "シグウィン", "リネ", "ファルザン", "コレイ", "ティナリ", "夜蘭", "ディオナ",
    "タルタリヤ", "フィッシュル", "甘雨", "ウェンティ", "宵宮", "アンバー", "ゴロー", "九条裟羅", "イファ", "ヴァレサ",
    "夢見月瑞希", "藍硯", "シトラリ", "ムアラニ", "閑雲", "シャルロット", "ヌヴィレット", "リオセスリ", "白朮", "放浪者",
    "ナヒーダ", "鹿野院平蔵", "モナ", "バーバラ", "スクロース", "珊瑚宮心海", "煙緋", "クレー", "凝光", "八重神子",
    "リサ", "エスコフィエ", "イアンサ", "カチーナ", "エミリエ", "アルレッキーノ", "シュヴルーズ", "ミカ", "ヨォーヨ",
    "キャンディス", "セノ", "魈", "香菱", "雷電将軍", "鍾離", "胡桃", "ロサリア", "申鶴", "トーマ", "雲菫"
];
